Documents/ЗаявкаКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияЗаявок</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СостоянияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияЗаявок</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаКлиента/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)  
	
// 1. Быстро вытаскиваем статус прямо из базы данных (в одну строку)
ТекущийСтатус = РегистрыСведений.СостоянияЗаявок.ПолучитьПоследнее(Дата, Новый Структура("Заявка", Ссылка)).СтатусЗаявки;

// 2. Проверяем: если заявка уже завершена — мгновенно отменяем проведение
Если ТекущийСтатус = Перечисления.СтатусыЗаявок.Закрыта ИЛИ 
	ТекущийСтатус = Перечисления.СтатусыЗаявок.Отменена Тогда
	ВызватьИсключение "Нельзя перепроводить заявку! Она уже закрыта или отменена.";
КонецЕсли;
	
	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		// регистр СостоянияЗаявок
		Движения.СостоянияЗаявок.Записывать = Истина;
		Движение = Движения.СостоянияЗаявок.Добавить();
		Движение.Период = Дата;
		Движение.Заявка = Ссылка;
		Движение.СтатусЗаявки = Перечисления.СтатусыЗаявок.Новая;
		Движение.Исполнитель = Исполнитель;
	КонецЕсли; 
	
КонецПроцедуры
